Revit 2024 API
RebarContainerIterator.Reset Method
 Resets the iterator to the initial state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace